Tekla Open API Reference for Tekla Structures 2025
Events.OnModelSaveInfo Method
 Called when model is saved.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void OnModelSaveInfo(
	string eventName,
	params Object[] parameters
)
Public Sub OnModelSaveInfo (
	eventName As String,
	ParamArray parameters As Object()
)
Parameters
eventName
Type: System.String
Name of the save event.
parameters
Type: System.Object[]
Event parameters. Contains the code which specifies the reason of the save action.
Implements
IEvents.OnModelSaveInfo(String, Object[])
See Also
Reference
Events Class
Tekla.Structures.Model Namespace